{
    "Home": {
        "greetings": "Привет, я",
        "name": "Артём Рахматуллин",
        "description": "Механический конструктор с новоприобретённой страстью к разработке внешнего интерфейса. Не стесняйтесь исследовать мой путь, включая образование, работу и проекты, а также мои приобретенные навыки. Не стесняйтесь обращаться через раздел контакты. Давайте сотрудничать и вместе создадим что-то удивительное."
    },
    "Navigation": {
        "home": "Главная",
        "about": "Обо мне",
        "education": "Образование",
        "skills": "Навыки",
        "contact": "Контакт"
    },
    "About": {
        "title": "Обо",
        "titleMe": "Мне",
        "frontendDeveloper": "Фронтенд-разработчик!",
        "aboutText": "Привет, я Артем Рахматуллин, механический конструктор с горячей страстью к цифровому миру. Как человек, который потратил годы на создание точности в физической сфере, я решил отправиться в увлекательное путешествие в сферу фронтенд-разработки. Мой карьерный сдвиг представляет собой сочетание моего пристального внимания к деталям и вновь обретенной любви к программированию, дизайну и пользовательскому опыту. Я считаю, что навыки, заложенные в механическом проектировании, такие как решение проблем и стремление к совершенству, прекрасно дополняют мир веб-разработки. От создания сложных моделей CAD до создания элегантных веб-интерфейсов — я нахожу удовольствие в каждом аспекте проектирования и разработки. Мое портфолио является свидетельством этого пути, демонстрируя проекты, которые устраняют разрыв между точным инжинирингом и идеальным дизайном интерфейса. Не стесняйтесь изучать мои работы, где вы найдете сочетание творчества и функциональности. Я приветствую возможности для сотрудничества и роста, поэтому давайте вместе формировать цифровой ландшафт."
    },
    "Education": {
        "titleMe": "Мое",
        "title": "Путешествие",
        "education": "Образование",
        "licenses": "Лицензии & сертификаты & курсы",
        "experience": "Опыт"
    },
    "Projects": {
        "title": "Проекты"
    },
    "Skills": {
        "titleMe": "Мои",
        "title": "Навыки",
        "git": "Знает использование Git, распределенной системы контроля версий, для эффективного управления репозиториями кода. Опыт управления версиями, включая ветвления, слияния и разрешение конфликтов. Навык сотрудничества с командами над проектами кода, использование Git для отслеживания изменений, ведения истории кода и обеспечения целостности кодовой базы.",
        "jest": "Опыт тестирования приложений React с использованием Jest, популярной среды тестирования JavaScript. Опыт написания модульных и интеграционных тестов для обеспечения надежности и удобства сопровождения кода. Навыки использования библиотеки тестирования React для проведения тестирования на уровне компонентов, уделяя особое внимание взаимодействию и поведению пользователей. Эти навыки тестирования способствуют созданию высококачественных приложений без ошибок."
    },
    "Contact": {
        "title": "Свяжитесь со",
        "titleMe": "Мной",
        "name": "Имя",
        "surname": "Фамилия",
        "mobileNumber": "Число телефона",
        "email": "Email",
        "yourMessage": "Ваше сообщение",
        "button": "Отправить"
    }
}